framework-4.5.1/app/Controllers/Board.php

SELECT *
FROM `board`
WHERE `board`.`bid` = '29'
DELETE FROM `board`
WHERE `bid` IN ('29')
---
    public function delete($bid = null)
    {
        $boardModel = new BoardModel();


        $board = $boardModel->find($bid); // = $boardModel->where('bid',$bid)->first();
        if ($board && session('userid') == $board->userid) {
            $boardModel -> delete($bid);
            $fileModel = new FileModel();
            $files = $fileModel->where('type','board')->where('bid',$bid)->findAll();
            // 파일 삭제 : unlink(경로,파일명); /uploads/board/103231235.jpg;

            foreach( $files as $file) {
                unlink('uploads/'.$file->filename);
            }
            $fileModel -> where('type','board')->where('bid',$bid)->delete(); // file_table 데이터 삭제