framework-4.5.1/app/Controllers/Board.php

    public function list(): string
    {
        // return view('board_list');
        // $db = db_connect();
        // $sql = "SELECT * FROM board ORDER BY bid";
        // $rs = $db -> query($sql);
        // $data['list'] = $rs->getResult();

        $boardModel = new BoardModel();
        $data['list'] = $boardModel->orderby('bid','desc')->findAll();
---
SELECT *
FROM `board`
ORDER BY `bid` DESC

    public function view($bid = null)
    {
        // $db = db_connect();
        // $sql = "SELECT * FROM board WHERE bid";
        // $rs = $db -> query($sql);
        // $data['view'] = $rs->getRow(); //배열이 아닌 값. == $rs->fetch_object();

        $boardModel = new BoardModel();
        $data['view'] = $boardModel->where('bid',$bid)->first();
---
SELECT *
FROM `board`
WHERE `bid` = '28'
 LIMIT 1